package lesson04;

public class Task03 {
    /* Объявите две переменные для длин прямоугольника,
    Напишите код для вычисления периметра прямоугольника и выведение результата.
     */
    public static void main (String[]args)
    {
        int leng = 100;
        int weight = 300;
    System.out.println((leng*2)+(weight*2));
    }
}
